{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 448, 640, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 448, 640, 3], "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of70.bin", "group1-shard2of70.bin", "group1-shard3of70.bin", "group1-shard4of70.bin", "group1-shard5of70.bin", "group1-shard6of70.bin", "group1-shard7of70.bin", "group1-shard8of70.bin", "group1-shard9of70.bin", "group1-shard10of70.bin", "group1-shard11of70.bin", "group1-shard12of70.bin", "group1-shard13of70.bin", "group1-shard14of70.bin", "group1-shard15of70.bin", "group1-shard16of70.bin", "group1-shard17of70.bin", "group1-shard18of70.bin", "group1-shard19of70.bin", "group1-shard20of70.bin", "group1-shard21of70.bin", "group1-shard22of70.bin", "group1-shard23of70.bin", "group1-shard24of70.bin", "group1-shard25of70.bin", "group1-shard26of70.bin", "group1-shard27of70.bin", "group1-shard28of70.bin", "group1-shard29of70.bin", "group1-shard30of70.bin", "group1-shard31of70.bin", "group1-shard32of70.bin", "group1-shard33of70.bin", "group1-shard34of70.bin", "group1-shard35of70.bin", "group1-shard36of70.bin", "group1-shard37of70.bin", "group1-shard38of70.bin", "group1-shard39of70.bin", "group1-shard40of70.bin", "group1-shard41of70.bin", "group1-shard42of70.bin", "group1-shard43of70.bin", "group1-shard44of70.bin", "group1-shard45of70.bin", "group1-shard46of70.bin", "group1-shard47of70.bin", "group1-shard48of70.bin", "group1-shard49of70.bin", "group1-shard50of70.bin", "group1-shard51of70.bin", "group1-shard52of70.bin", "group1-shard53of70.bin", "group1-shard54of70.bin", "group1-shard55of70.bin", "group1-shard56of70.bin", "group1-shard57of70.bin", "group1-shard58of70.bin", "group1-shard59of70.bin", "group1-shard60of70.bin", "group1-shard61of70.bin", "group1-shard62of70.bin", "group1-shard63of70.bin", "group1-shard64of70.bin", "group1-shard65of70.bin", "group1-shard66of70.bin", "group1-shard67of70.bin", "group1-shard68of70.bin", "group1-shard69of70.bin", "group1-shard70of70.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [16], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1138192, 64], "dtype": "float32"}, {"name": "dense/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [64, 5], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32"}]}]}